In [1]:
import pandas as pd
import numpy as np

In [2]:
df1 = pd.read_csv('customer_details.csv')
df1

               0       1     2    3     4    5          6    7
0            1.0    Male  44.0  1.0  28.0  0.0  > 2 Years  Yes
1            2.0    Male  76.0  1.0   3.0  0.0   1-2 Year   No
2            3.0    Male  47.0  1.0  28.0  0.0  > 2 Years  Yes
3            4.0    Male  21.0  1.0  11.0  1.0   < 1 Year   No
4            5.0  Female  29.0  1.0  41.0  1.0   < 1 Year   No
...          ...     ...   ...  ...   ...  ...        ...  ...
381104  381105.0    Male  74.0  1.0  26.0  1.0   1-2 Year   No
381105  381106.0    Male  30.0  1.0  37.0  1.0   < 1 Year   No
381106  381107.0    Male  21.0  1.0  30.0  1.0   < 1 Year   No
381107  381108.0  Female  68.0  1.0  14.0  0.0  > 2 Years  Yes
381108  381109.0    Male  46.0  1.0  29.0  0.0   1-2 Year   No

[381109 rows x 8 columns]

In [3]:
df1.columns

Index(['0', '1', '2', '3', '4', '5', '6', '7'], dtype='object')

In [4]:
df1.columns=['Customer_id','Gender','Age','Driving_Licence_Present','Region_Code','Previously_Insured','Vehicle_Age','Vehicle_Damage']

In [5]:
df1

,Customer_id,Gender,Age,Driving_Licence_Present,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage
0,1.0,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,2.0,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,3.0,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,4.0,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,5.0,Female,29.0,1.0,41.0,1.0,< 1 Year,No
...,...,...,...,...,...,...,...,...
381104,381105.0,Male,74.0,1.0,26.0,1.0,1-2 Year,No
381105,381106.0,Male,30.0,1.0,37.0,1.0,< 1 Year,No
381106,381107.0,Male,21.0,1.0,30.0,1.0,< 1 Year,No
381107,381108.0,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes
381108,381109.0,Male,46.0,1.0,29.0,0.0,1-2 Year,No

In [6]:
#CHECKING AND CLEANING DATA FROM CUSTOMER_DETAILS.CSV

print('Null Values in Cusmoter_id:',df1['Customer_id'].isna().sum())

Null Values in Cusmoter_id: 386

In [7]:
df1['Customer_id']=df1['Customer_id'].isnull().sum()

In [8]:
print('Null Values in Gender:',df1['Gender'].isna().sum())

Null Values in Gender: 368

In [9]:
print('Null Values in Age:',df1['Age'].isna().sum())

Null Values in Age: 368

In [10]:
print('Null Values in Driving_Licence_Present:',df1['Driving_Licence_Present'].isna().sum())

Null Values in Driving_Licence_Present: 393

In [11]:
print('Null Values in Region_Code:',df1['Region_Code'].isna().sum())

Null Values in Region_Code: 392

In [12]:
print('Null Values in Previously_Insured:',df1['Previously_Insured'].isna().sum())

Null Values in Previously_Insured: 381

In [13]:
print('Null Values in Vehicle_Age:',df1['Vehicle_Age'].isna().sum())

Null Values in Vehicle_Age: 381

In [14]:
print('Null Values in Vehicle_Damage:',df1['Vehicle_Damage'].isna().sum())

Null Values in Vehicle_Damage: 407

In [15]:
# DROPING AND FILLING NULL Values
df1.dropna(subset=[],inplace=True)

In [17]:
df1['Gender'].fillna(df1['Gender'].mode()[0],inplace=True)

In [18]:
df1

,Customer_id,Gender,Age,Driving_Licence_Present,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage
0,386,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,386,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,386,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,386,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,386,Female,29.0,1.0,41.0,1.0,< 1 Year,No
...,...,...,...,...,...,...,...,...
381104,386,Male,74.0,1.0,26.0,1.0,1-2 Year,No
381105,386,Male,30.0,1.0,37.0,1.0,< 1 Year,No
381106,386,Male,21.0,1.0,30.0,1.0,< 1 Year,No
381107,386,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes
381108,386,Male,46.0,1.0,29.0,0.0,1-2 Year,No

In [19]:
df1['Age'].fillna(df1['Age'].mean(),inplace=True)

In [20]:
print('Null values in Age after droping Nall Values:',df1['Age'].isna().sum())

Null values in Age after droping Nall Values: 0

In [21]:
df1['Driving_Licence_Present'].fillna(df1['Driving_Licence_Present'].mode()[0],inplace=True)

In [22]:
print('Null values in Driving_Licence_Present:',df1['Driving_Licence_Present'].isna().sum())

Null values in Driving_Licence_Present: 0

In [23]:
df1['Region_Code'].fillna(df1['Region_Code'].mode()[0],inplace=True)

In [24]:
print('Null values in Region_code after droping Null values:',df1['Region_Code'].isna().sum())

Null values in Region_code after droping Null values: 0

In [25]:

df1['Previously_Insured'].fillna(df1['Previously_Insured'].mode()[0],inplace=True)
print('Null Values in Previously_Insured after droping Null values:',df1['Previously_Insured'].isna().sum())

Null Values in Previously_Insured after droping Null values: 0

In [26]:
df1['Vehicle_Age'].fillna(df1['Vehicle_Age'].mode()[0],inplace=True)
print('Null Values in Vechicle_Age after droping Null values:',df1['Vehicle_Age'].isna().sum())

Null Values in Vechicle_Age after droping Null values: 0

In [27]:
df1['Vehicle_Damage'].fillna(df1['Vehicle_Damage'].mode()[0],inplace=True)
print('Null Values in Vechicle_Damage after droping Null values:',df1['Vehicle_Damage'].isna().sum())

Null Values in Vechicle_Damage after droping Null values: 0

In [28]:
df1.describe()

,Customer_id,Age,Driving_Licence_Present,Region_Code,Previously_Insured
count,381109.0,381109.000000,381109.000000,381109.000000,381109.000000
mean,386.0,38.822827,0.997869,26.390232,0.457788
std,0.0,15.504629,0.046110,13.223656,0.498216
min,386.0,20.000000,0.000000,0.000000,0.000000
25%,386.0,25.000000,1.000000,15.000000,0.000000
50%,386.0,36.000000,1.000000,28.000000,0.000000
75%,386.0,49.000000,1.000000,35.000000,1.000000
max,386.0,85.000000,1.000000,52.000000,1.000000

In [29]:
#Quntliners

Q1 = df1.describe().loc["25%","Age"]
Q3 = df1.describe().loc["75%","Age"]

IQR = Q3 - Q1

print('outliners in Age:',df1.loc[df1["Age"]<(Q1 - IQR*1.5),"Age"].count())
print('outliners in Age:',df1.loc[df1["Age"]>(Q3 + IQR*1.5),"Age"].count())

outliners in Age: 0
outliners in Age: 0

In [30]:
Q1 = df1.describe().loc["25%","Region_Code"]
Q3 = df1.describe().loc["75%","Region_Code"]

IQR = Q3 - Q1

print('outliners in Region_Code:',df1.loc[df1["Region_Code"]<(Q1 - IQR*1.5),"Age"].count())
print('outliners in Region_Code:',df1.loc[df1["Region_Code"]>(Q3 + IQR*1.5),"Age"].count())

outliners in Region_Code: 0
outliners in Region_Code: 0

In [31]:
Q1 = df1.describe().loc["25%","Region_Code"]
Q3 = df1.describe().loc["75%","Region_Code"]

IQR = Q3 - Q1

print('outliners in Region_Code:',df1.loc[df1["Region_Code"]<(Q1 - IQR*1.5),"Region_Code"].count())
print('outliners in Region_Code:',df1.loc[df1["Region_Code"]>(Q3 + IQR*1.5),"Region_Code"].count())

outliners in Region_Code: 0
outliners in Region_Code: 0

In [32]:
#REMOVE SPACES

df1["Gender"]=df1["Gender"].str.strip()
df1["Vehicle_Age"]=df1["Vehicle_Age"].str.strip()
df1["Vehicle_Damage"]=df1["Vehicle_Damage"].str.strip()

In [33]:
df1

,Customer_id,Gender,Age,Driving_Licence_Present,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage
0,386,Male,44.0,1.0,28.0,0.0,> 2 Years,Yes
1,386,Male,76.0,1.0,3.0,0.0,1-2 Year,No
2,386,Male,47.0,1.0,28.0,0.0,> 2 Years,Yes
3,386,Male,21.0,1.0,11.0,1.0,< 1 Year,No
4,386,Female,29.0,1.0,41.0,1.0,< 1 Year,No
...,...,...,...,...,...,...,...,...
381104,386,Male,74.0,1.0,26.0,1.0,1-2 Year,No
381105,386,Male,30.0,1.0,37.0,1.0,< 1 Year,No
381106,386,Male,21.0,1.0,30.0,1.0,< 1 Year,No
381107,386,Female,68.0,1.0,14.0,0.0,> 2 Years,Yes
381108,386,Male,46.0,1.0,29.0,0.0,1-2 Year,No

In [34]:
#case correction

df1["Gender"]=df1["Gender"].str.lower()
df1["Vehicle_Age"]=df1["Vehicle_Age"].str.lower()
df1["Vehicle_damage"]=df1["Vehicle_Damage"].str.lower()

In [35]:
#convert nominal into dummies

dummies_Gender=pd.get_dummies(df1["Vehicle_Age"])
dummies_Vehicle_Agg=pd.get_dummies(df1["Vehicle_Age"])
dummies_Vehicle_Damage=pd.get_dummies(df1["Vehicle_Damage"])
dummies_dlp=pd.get_dummies(df1["Driving_Licence_Present"])
dummies_Pi=pd.get_dummies(df1["Previously_Insured"])

In [36]:
# Drop Duplicates

print(df1.duplicated().sum())

355784

In [37]:
df2 = pd.read_csv("customer_policy_details.csv")
df2

               0        1      2      3    4
0            1.0  40454.0   26.0  217.0  1.0
1            2.0  33536.0   26.0  183.0  0.0
2            3.0  38294.0   26.0   27.0  1.0
3            4.0  28619.0  152.0  203.0  0.0
4            5.0  27496.0  152.0   39.0  0.0
...          ...      ...    ...    ...  ...
381104  381105.0  30170.0   26.0   88.0  0.0
381105  381106.0  40016.0  152.0  131.0  0.0
381106  381107.0  35118.0  160.0  161.0  0.0
381107  381108.0  44617.0  124.0   74.0  0.0
381108  381109.0  41777.0   26.0  237.0  0.0

[381109 rows x 5 columns]

In [38]:
df2.columns=['Customer_id','Annual_Premium(Rs)','Sales_Channel_Code','Vintage','Response']

In [39]:
df2

        Customer_id  Annual_Premium(Rs)  Sales_Channel_Code  Vintage  Response
0               1.0             40454.0                26.0    217.0       1.0
1               2.0             33536.0                26.0    183.0       0.0
2               3.0             38294.0                26.0     27.0       1.0
3               4.0             28619.0               152.0    203.0       0.0
4               5.0             27496.0               152.0     39.0       0.0
...             ...                 ...                 ...      ...       ...
381104     381105.0             30170.0                26.0     88.0       0.0
381105     381106.0             40016.0               152.0    131.0       0.0
381106     381107.0             35118.0               160.0    161.0       0.0
381107     381108.0             44617.0               124.0     74.0       0.0
381108     381109.0             41777.0                26.0    237.0       0.0

[381109 rows x 5 columns]

In [40]:
# Checking and cleaning data from customer_detalies.csv


print('Null values in customer_id:',df2['Customer_id'].isna().sum())

Null values in customer_id: 387

In [41]:
print('Null values in Annual_Premium(Rs):',df2['Annual_Premium(Rs)'].isna().sum())

Null values in Annual_Premium(Rs): 346

In [42]:
print('Null values in Sales_Channel_Code:',df2['Sales_Channel_Code'].isna().sum())

Null values in Sales_Channel_Code: 400

In [43]:
print('Null values in Vintage:',df2['Vintage'].isna().sum())

Null values in Vintage: 388

In [44]:
print('Null values in Response:',df2['Response'].isna().sum())

Null values in Response: 361

In [45]:
#droping and filling Null values

df2.dropna(subset=['Customer_id'],inplace=True)

In [46]:
df2['Customer_id'].fillna(df2['Customer_id'].mean(),inplace=True)
print('Null values in Customer_id after droping Null values:',df2['Customer_id'].isna().sum())

Null values in Customer_id after droping Null values: 0

In [47]:
print('Null values in  customer_id after droping Null Values:',df2['Customer_id'].isna().sum())

Null values in  customer_id after droping Null Values: 0

In [48]:
df2['Annual_Premium(Rs)'].fillna(df2['Annual_Premium(Rs)'].mean(),inplace=True)
print('Null values in Auual_Premium(Rs) after droping Null values:',df2['Annual_Premium(Rs)'].isna().sum())

Null values in Auual_Premium(Rs) after droping Null values: 0

In [49]:
df2['Sales_Channel_Code'].fillna(df2['Sales_Channel_Code'].mean(),inplace=True)
print('Null values in Sales_Channel_Code  after droping Null values:',df2['Sales_Channel_Code'].isna().sum())

Null values in Sales_Channel_Code  after droping Null values: 0

In [50]:
df2['Vintage'].fillna(df2['Vintage'].mean(),inplace=True)
print('Null values in Vintage after droping Null values:',df2['Vintage'].isna().sum())

Null values in Vintage after droping Null values: 0

In [51]:
df2['Response'].fillna(df2['Response'].mean(),inplace=True)
print('Null values in Response after droping Null values:',df2['Response'].isna().sum())

Null values in Response after droping Null values: 0

In [52]:
df2.describe()

,Customer_id,Annual_Premium(Rs),Sales_Channel_Code,Vintage,Response
count,380722.000000,380722.000000,380722.000000,380722.000000,380722.000000
mean,190547.491663,30563.999774,112.036687,154.347192,0.122526
std,110013.824148,17190.147550,54.177046,83.628096,0.327737
min,1.000000,2630.000000,1.000000,10.000000,0.000000
25%,95276.250000,24416.000000,29.000000,82.000000,0.000000
50%,190536.500000,31656.000000,131.000000,154.000000,0.000000
75%,285818.750000,39391.750000,152.000000,227.000000,0.000000
max,381109.000000,540165.000000,163.000000,299.000000,1.000000

In [53]:
#Qutliners


Q1 = df2.describe().loc["25%","Annual_Premium(Rs)"]
Q3 = df2.describe().loc["75%","Annual_Premium(Rs)"]

IQR = Q3 - Q1


print('outliners in Annual_Premium(Rs) :',df2.loc[df2["Annual_Premium(Rs)"]<(Q1 - IQR*1.5),"Annual_Premium(Rs)"].count())
print('outliners in Annual_Premium(Rs):',df2.loc[df2["Annual_Premium(Rs)"]>(Q3 + IQR*1.5),"Annual_Premium(Rs)"].count())

outliners in Annual_Premium(Rs) : 0
outliners in Annual_Premium(Rs): 10332

In [54]:
mean = df2["Annual_Premium(Rs)"].mean()

In [55]:
mean

30563.99977390893

In [56]:
df2.loc[df2["Annual_Premium(Rs)"]>(Q3 + IQR*1.5),"Annual_Premium(Rs)"]=np.nan

In [57]:



df2.fillna(mean,inplace=True)

In [58]:
print('outliners in Annual_Premium(Rs):',df2.loc[df2["Annual_Premium(Rs)"]>(Q3 + IQR*1.5),"Annual_Premium(Rs)"].count())

outliners in Annual_Premium(Rs): 0

In [59]:
df2['Annual_Premium(Rs)']

0         40454.0
1         33536.0
2         38294.0
3         28619.0
4         27496.0
           ...
381104    30170.0
381105    40016.0
381106    35118.0
381107    44617.0
381108    41777.0
Name: Annual_Premium(Rs), Length: 380722, dtype: float64

In [60]:
# white space, case correction

# drop duplicate

print(df2.duplicated().sum)

<bound method NDFrame._add_numeric_operations.<locals>.sum of 0         False
1         False
2         False
3         False
4         False
          ...
381104    False
381105    False
381106    False
381107    False
381108    False
Length: 380722, dtype: bool>

In [61]:
# merging the data

master_data=pd.merge(df1,df2,on='Customer_id')

In [62]:
master_data

,Customer_id,Gender,Age,Driving_Licence_Present,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Vehicle_damage,Annual_Premium(Rs),Sales_Channel_Code,Vintage,Response
0,386,male,44.0,1.0,28.0,0.0,> 2 years,Yes,yes,38452.0,26.0,51.0,0.0
1,386,male,76.0,1.0,3.0,0.0,1-2 year,No,no,38452.0,26.0,51.0,0.0
2,386,male,47.0,1.0,28.0,0.0,> 2 years,Yes,yes,38452.0,26.0,51.0,0.0
3,386,male,21.0,1.0,11.0,1.0,< 1 year,No,no,38452.0,26.0,51.0,0.0
4,386,female,29.0,1.0,41.0,1.0,< 1 year,No,no,38452.0,26.0,51.0,0.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
381104,386,male,74.0,1.0,26.0,1.0,1-2 year,No,no,38452.0,26.0,51.0,0.0
381105,386,male,30.0,1.0,37.0,1.0,< 1 year,No,no,38452.0,26.0,51.0,0.0
381106,386,male,21.0,1.0,30.0,1.0,< 1 year,No,no,38452.0,26.0,51.0,0.0
381107,386,female,68.0,1.0,14.0,0.0,> 2 years,Yes,yes,38452.0,26.0,51.0,0.0
381108,386,male,46.0,1.0,29.0,0.0,1-2 year,No,no,38452.0,26.0,51.0,0.0

In [63]:
#Gender wise average annual premium

gwap=master_data.groupby(["Gender"])["Annual_Premium(Rs)"].mean()

In [64]:
gwap

Gender
female    38452.0
male      38452.0
Name: Annual_Premium(Rs), dtype: float64

In [65]:
#Age wise average annual premium

awap=master_data.groupby(["Age"])["Annual_Premium(Rs)"].mean()

In [66]:
awap

Age
20.0    38452.0
21.0    38452.0
22.0    38452.0
23.0    38452.0
24.0    38452.0
         ...
81.0    38452.0
82.0    38452.0
83.0    38452.0
84.0    38452.0
85.0    38452.0
Name: Annual_Premium(Rs), Length: 67, dtype: float64

In [67]:
#Is your data balanced between the genders?


master_data.groupby('Gender').count()

,Customer_id,Age,Driving_Licence_Present,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Vehicle_damage,Annual_Premium(Rs),Sales_Channel_Code,Vintage,Response
Gender,,,,,,,,,,,,
female,174851,174851,174851,174851,174851,174851,174851,174851,174851,174851,174851,174851
male,206258,206258,206258,206258,206258,206258,206258,206258,206258,206258,206258,206258

In [68]:

gwap=master_data.groupby(["Gender"])["Annual_Premium(Rs)"].mean()

In [69]:
gwap

Gender
female    38452.0
male      38452.0
Name: Annual_Premium(Rs), dtype: float64

In [70]:
#Vehicle age wise average annual premium

vwap=master_data.groupby(["Vehicle_Age"])["Annual_Premium(Rs)"].mean()

In [71]:
vwap

Vehicle_Age
1-2 year     38452.0
< 1 year     38452.0
> 2 years    38452.0
Name: Annual_Premium(Rs), dtype: float64

In [72]:
#relation between Person Age and annual premium (Correlation describes the relationship between two variables). 


master_data['Age'].corr(master_data["Annual_Premium(Rs)"])

nan

In [73]:
master_data[['Age','Annual_Premium(Rs)']].corr()

                    Age  Annual_Premium(Rs)
Age                 1.0                 NaN
Annual_Premium(Rs)  NaN                 NaN

In [74]:
n = master_data['Age'].corr(master_data['Annual_Premium(Rs)'])
if n<0.5:
    print("strong negative relationship")
if n>-0.5 and n<0.5:
    print("there is no relationship!")